Catalogs/ВидыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВидыРемонта</Name>
			<Comment>Виды авторемонта</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипРемонта</Name>
					<Comment>Типы ремонта (платный/бесплатный)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСебестоимость</Name>
					<Comment>Распределить на себестоимость автомобиля</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходаДетали</Name>
					<Comment>Статья расхода деталей</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходаДетали</Name>
					<Comment>Статья дохода деталей</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходаРаботы</Name>
					<Comment>Статья дохода работ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехОбслуживание</Name>
					<Comment>Признак техобслуживание</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыработкаСотрудниковПоВыполнениюЗаказНаряда</Name>
					<Comment>Выработка сотрудников по выполнению заказ наряда</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДСРаботы</Name>
					<Comment>Работы без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Товары без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияЗавода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерческий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВПроактивномКонтакте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьВремяРаботыСДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаМастеромПриемщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьВСтатусеВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьЗЧИРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатильщикПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноЗаполнятьКомментарийВЗН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОбозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SendWA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьСуммыВЗН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDR_ЛКМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьУведомления</Name>
					<Comment>Признак отправки уведомлений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПриЗаписиНаРемонт</Name>
					<Comment>Шаблон, по которому будет формироватся сообщение при записи на ремонт</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПриОтменеЗаявки</Name>
					<Comment>Шаблон, по которому будет формироватся сообщение отмене заявки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаОтправки</Name>
					<Comment>Начало промежутка времени, в которое необходимо отправлять смс</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияОтправки</Name>
					<Comment>Конец промежутка времени, в которое необходимо отправлять смс</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьЗаВремя</Name>
					<Comment>Количество часов, за которое необходимо отправлять смс сообщение.   </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапчастиПоСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гарантия</Name>
					<Comment>Гарантийные плательщики</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Гарантийный плательщик</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорВзаиморасчетов</Name>
							<Comment>Договор взаиморасчетов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокРемонта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
					<Comment>Работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Comment>Авторабота</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СостояниеЗаказНаряда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаказНарядов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныТекстовыхСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СМ_ШЕВРОЛЕ/Ext/Module.bsl
//Бондаренко++ 20220202
Процедура ИнтерактивнаяПроверкаСВыгрузкой(Ссылка) Экспорт                      
	
	СзВидовРемонтаДляВыгрузкиПоШевроле = Новый СписокЗначений;
	
	СзВидовРемонтаДляВыгрузкиПоШевроле.Добавить(Справочники.ВидыРемонта.ГарантияПроизводителя);
	СзВидовРемонтаДляВыгрузкиПоШевроле.Добавить(Справочники.ВидыРемонта.КоммерческийРемонт);
	СзВидовРемонтаДляВыгрузкиПоШевроле.Добавить(Справочники.ВидыРемонта.ТехническоеОбслуживание);
	//Бондаренко++ 20220606
	СзВидовРемонтаДляВыгрузкиПоШевроле.Добавить(Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное);	
	//Бондаренко-- 20220606
 	СзВидовРемонтаДляВыгрузкиПоШевроле.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование);
	СзВидовРемонтаДляВыгрузкиПоШевроле.Добавить(Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером);
   	
	Если Ссылка.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000231") ИЛИ
		 Ссылка.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001330")  ИЛИ
		 Ссылка.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000126")  Тогда
		Если ( (Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен) И (Ссылка.ВидРемонта = Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя) ) ИЛИ 
			 ( (Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт)   И (СзВидовРемонтаДляВыгрузкиПоШевроле.НайтиПоЗначению(Ссылка.ВидРемонта)<>Неопределено) ) Тогда
			 Если Ссылка.Автомобиль.ГодВыпуска >= Дата(2020,1,1) Тогда
 				СМ_ШЕВРОЛЕ_Сервер.ВыгрузитьЗНпоШевроле(Ссылка);					                                            
				Сообщить("Завершена выгрузка на портал CHEVROLET",СтатусСообщения.Информация);
			Иначе
				Сообщить("Дата выпуска авто в документе '"+СокрЛП(Ссылка.Автомобиль.ГодВыпуска)+"' не соответствует критериям выгрузки на портал. Должна быть больше (или равна) 1 января 2020.",СтатусСообщения.ОченьВажное);							 		
			КонецЕсли;
		Иначе
			Сообщить("Вид ремонта документа '"+СокрЛП(Ссылка.ВидРемонта)+"'и состояние документа '"+СокрЛП(Ссылка.Состояние)+"' не соответствуют критериям выгрузки на портал. Должен быть 'Коммерческий ремонт','Техническое обслуживание' или 'Гарантия производителя'",СтатусСообщения.ОченьВажное);							 	
		КонецЕсли;	                                                   
	Иначе
		Сообщить("Подразделение документа '"+СокрЛП(Ссылка.Организация)+"' не соответствует критериям выгрузки на портал. Должно быть 'Престиж Моторс ООО Пойменная', 'Престиж Моторс ООО Волгодонск Лада' или 'Престиж Моторс ООО Олимп'",СтатусСообщения.ОченьВажное);						
	КонецЕсли;	
  	
КонецПроцедуры // ИнтерактивнаяПроверкаСВыгрузкой(Ссылка)
//Бондаренко++ 20220202
